package spiral.bit.dev.lgbtswipe.other

//TODO 1: ИСПРАВИТЬ ПРОБЛЕМУ С НАЛОЖЕНИЕМ ФРАГМЕНТОВ, ЕСЛИ КЛИКАЕШЬ ПО КНОПКЕ, КОТОРАЯ ВЕДЁТ НА ФРАГМЕНТ,
// В КОТОРОМ ТЫ НАХОДИШЬСЯ, НЕ ДОЛЖНА СНОВА ОТРАБАТЫВАТЬ ТРАНЗАКЦИЯ, ЧТОБЫ НЕ БЫЛО 2000 ФРАГМЕНТОВ В БЭКСТЕКЕ

//TODO 2: ИСПРАВИТЬ НЕОТОБРАЖЕНИЕ СООБЩЕНИЙ, В БАЗЕ ИХ ВИДНО, НО ВОТ В ПЕРЕПИСКЕ НЕТ

//TODO 3: ДОПИЛИТЬ ПРОФИЛЬ, СВОЯ СИМПАТИЯ НЕ ДОЛЖНА ЛЕТЕТЬ В СИМПАТИИ, СДЕЛАТЬ ЕГО ГОРАЗДО ОБШИРНЕЕ И ДОБАВИТЬ МНОЖЕСТВО ИНФЫ О СЕБЕ

//TODO 4: СВИТЧ ИСКАТЬ ТОЛЬКО ПО МОЕМУ ГЕНДЕРУ

//TODO 5; СЛЕГКА РЕДИЗАЙН

//TODO 6: ФУНКЦИОНАЛ ЗВОНКОВ

//TODO 7: ДОПИЛИТЬ ЧАТЛИСТ, ФУНКЦИОНАЛ ЧАТА